ataradov/mcu-starter-projects/samg53/include/component/usart.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_RPR_OFFSET                       (0x100)                                       /**<  (US_RPR) Receive Pointer Register  Offset */

#define US_RPR_RXPTR_Pos                    0                                              /**< (US_RPR) Receive Pointer Register Position */
#define US_RPR_RXPTR_Msk                    (_U_(0xFFFFFFFF) << US_RPR_RXPTR_Pos)          /**< (US_RPR) Receive Pointer Register Mask */
#define US_RPR_RXPTR(value)                 (US_RPR_RXPTR_Msk & ((value) << US_RPR_RXPTR_Pos))
#define US_RPR_MASK                         _U_(0xFFFFFFFF)                                /**< \deprecated (US_RPR) Register MASK  (Use US_RPR_Msk instead)  */
#define US_RPR_Msk                          _U_(0xFFFFFFFF)                                /**< (US_RPR) Register Mask  */


/* -------- US_RCR : (USART Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXCTR:16;                  /**< bit:  0..15  Receive Counter Register                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} US_RCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_RCR_OFFSET                       (0x104)                                       /**<  (US_RCR) Receive Counter Register  Offset */

#define US_RCR_RXCTR_Pos                    0                                              /**< (US_RCR) Receive Counter Register Position */
#define US_RCR_RXCTR_Msk                    (_U_(0xFFFF) << US_RCR_RXCTR_Pos)              /**< (US_RCR) Receive Counter Register Mask */
#define US_RCR_RXCTR(value)                 (US_RCR_RXCTR_Msk & ((value) << US_RCR_RXCTR_Pos))
#define US_RCR_MASK                         _U_(0xFFFF)                                    /**< \deprecated (US_RCR) Register MASK  (Use US_RCR_Msk instead)  */
#define US_RCR_Msk                          _U_(0xFFFF)                                    /**< (US_RCR) Register Mask  */


/* -------- US_TPR : (USART Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXPTR:32;                  /**< bit:  0..31  Transmit Counter Register                */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} US_TPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_TPR_OFFSET                       (0x108)                                       /**<  (US_TPR) Transmit Pointer Register  Offset */

#define US_TPR_TXPTR_Pos                    0                                              /**< (US_TPR) Transmit Counter Register Position */
#define US_TPR_TXPTR_Msk                    (_U_(0xFFFFFFFF) << US_TPR_TXPTR_Pos)          /**< (US_TPR) Transmit Counter Register Mask */
#define US_TPR_TXPTR(value)                 (US_TPR_TXPTR_Msk & ((value) << US_TPR_TXPTR_Pos))
#define US_TPR_MASK                         _U_(0xFFFFFFFF)                                /**< \deprecated (US_TPR) Register MASK  (Use US_TPR_Msk instead)  */
#define US_TPR_Msk                          _U_(0xFFFFFFFF)                                /**< (US_TPR) Register Mask  */


/* -------- US_TCR : (USART Offset: 0x10c) (R/W 32) Transmit Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXCTR:16;                  /**< bit:  0..15  Transmit Counter Register                */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} US_TCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_TCR_OFFSET                       (0x10C)                                       /**<  (US_TCR) Transmit Counter Register  Offset */

#define US_TCR_TXCTR_Pos                    0                                              /**< (US_TCR) Transmit Counter Register Position */
#define US_TCR_TXCTR_Msk                    (_U_(0xFFFF) << US_TCR_TXCTR_Pos)              /**< (US_TCR) Transmit Counter Register Mask */
#define US_TCR_TXCTR(value)                 (US_TCR_TXCTR_Msk & ((value) << US_TCR_TXCTR_Pos))
#define US_TCR_MASK                         _U_(0xFFFF)                                    /**< \deprecated (US_TCR) Register MASK  (Use US_TCR_Msk instead)  */
#define US_TCR_Msk                          _U_(0xFFFF)                                    /**< (US_TCR) Register Mask  */


/* -------- US_RNPR : (USART Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNPTR:32;                 /**< bit:  0..31  Receive Next Pointer                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} US_RNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_RNPR_OFFSET                      (0x110)                                       /**<  (US_RNPR) Receive Next Pointer Register  Offset */

#define US_RNPR_RXNPTR_Pos                  0                                              /**< (US_RNPR) Receive Next Pointer Position */
#define US_RNPR_RXNPTR_Msk                  (_U_(0xFFFFFFFF) << US_RNPR_RXNPTR_Pos)        /**< (US_RNPR) Receive Next Pointer Mask */
#define US_RNPR_RXNPTR(value)               (US_RNPR_RXNPTR_Msk & ((value) << US_RNPR_RXNPTR_Pos))
#define US_RNPR_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (US_RNPR) Register MASK  (Use US_RNPR_Msk instead)  */
#define US_RNPR_Msk                         _U_(0xFFFFFFFF)                                /**< (US_RNPR) Register Mask  */


/* -------- US_RNCR : (USART Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXNCTR:16;                 /**< bit:  0..15  Receive Next Counter                     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} US_RNCR_Type;
