ataradov/mcu-starter-projects/samg53/include/component/usart.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_RNCR_OFFSET                      (0x114)                                       /**<  (US_RNCR) Receive Next Counter Register  Offset */

#define US_RNCR_RXNCTR_Pos                  0                                              /**< (US_RNCR) Receive Next Counter Position */
#define US_RNCR_RXNCTR_Msk                  (_U_(0xFFFF) << US_RNCR_RXNCTR_Pos)            /**< (US_RNCR) Receive Next Counter Mask */
#define US_RNCR_RXNCTR(value)               (US_RNCR_RXNCTR_Msk & ((value) << US_RNCR_RXNCTR_Pos))
#define US_RNCR_MASK                        _U_(0xFFFF)                                    /**< \deprecated (US_RNCR) Register MASK  (Use US_RNCR_Msk instead)  */
#define US_RNCR_Msk                         _U_(0xFFFF)                                    /**< (US_RNCR) Register Mask  */


/* -------- US_TNPR : (USART Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNPTR:32;                 /**< bit:  0..31  Transmit Next Pointer                    */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} US_TNPR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_TNPR_OFFSET                      (0x118)                                       /**<  (US_TNPR) Transmit Next Pointer Register  Offset */

#define US_TNPR_TXNPTR_Pos                  0                                              /**< (US_TNPR) Transmit Next Pointer Position */
#define US_TNPR_TXNPTR_Msk                  (_U_(0xFFFFFFFF) << US_TNPR_TXNPTR_Pos)        /**< (US_TNPR) Transmit Next Pointer Mask */
#define US_TNPR_TXNPTR(value)               (US_TNPR_TXNPTR_Msk & ((value) << US_TNPR_TXNPTR_Pos))
#define US_TNPR_MASK                        _U_(0xFFFFFFFF)                                /**< \deprecated (US_TNPR) Register MASK  (Use US_TNPR_Msk instead)  */
#define US_TNPR_Msk                         _U_(0xFFFFFFFF)                                /**< (US_TNPR) Register Mask  */


/* -------- US_TNCR : (USART Offset: 0x11c) (R/W 32) Transmit Next Counter Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TXNCTR:16;                 /**< bit:  0..15  Transmit Counter Next                    */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} US_TNCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_TNCR_OFFSET                      (0x11C)                                       /**<  (US_TNCR) Transmit Next Counter Register  Offset */

#define US_TNCR_TXNCTR_Pos                  0                                              /**< (US_TNCR) Transmit Counter Next Position */
#define US_TNCR_TXNCTR_Msk                  (_U_(0xFFFF) << US_TNCR_TXNCTR_Pos)            /**< (US_TNCR) Transmit Counter Next Mask */
#define US_TNCR_TXNCTR(value)               (US_TNCR_TXNCTR_Msk & ((value) << US_TNCR_TXNCTR_Pos))
#define US_TNCR_MASK                        _U_(0xFFFF)                                    /**< \deprecated (US_TNCR) Register MASK  (Use US_TNCR_Msk instead)  */
#define US_TNCR_Msk                         _U_(0xFFFF)                                    /**< (US_TNCR) Register Mask  */


/* -------- US_PTCR : (USART Offset: 0x120) (/W 32) Transfer Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t RXTDIS:1;                  /**< bit:      1  Receiver Transfer Disable                */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t TXTDIS:1;                  /**< bit:      9  Transmitter Transfer Disable             */
    uint32_t :6;                        /**< bit: 10..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t RXCBDIS:1;                 /**< bit:     17  Receiver Circular Buffer Disable         */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t TXCBDIS:1;                 /**< bit:     19  Transmitter Circular Buffer Disable      */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t ERRCLR:1;                  /**< bit:     24  Transfer Bus Error Clear                 */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} US_PTCR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_PTCR_OFFSET                      (0x120)                                       /**<  (US_PTCR) Transfer Control Register  Offset */

#define US_PTCR_RXTEN_Pos                   0                                              /**< (US_PTCR) Receiver Transfer Enable Position */
#define US_PTCR_RXTEN_Msk                   (_U_(0x1) << US_PTCR_RXTEN_Pos)                /**< (US_PTCR) Receiver Transfer Enable Mask */
#define US_PTCR_RXTEN                       US_PTCR_RXTEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTCR_RXTEN_Msk instead */
#define US_PTCR_RXTDIS_Pos                  1                                              /**< (US_PTCR) Receiver Transfer Disable Position */
#define US_PTCR_RXTDIS_Msk                  (_U_(0x1) << US_PTCR_RXTDIS_Pos)               /**< (US_PTCR) Receiver Transfer Disable Mask */
#define US_PTCR_RXTDIS                      US_PTCR_RXTDIS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTCR_RXTDIS_Msk instead */
#define US_PTCR_TXTEN_Pos                   8                                              /**< (US_PTCR) Transmitter Transfer Enable Position */
#define US_PTCR_TXTEN_Msk                   (_U_(0x1) << US_PTCR_TXTEN_Pos)                /**< (US_PTCR) Transmitter Transfer Enable Mask */
#define US_PTCR_TXTEN                       US_PTCR_TXTEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTCR_TXTEN_Msk instead */
#define US_PTCR_TXTDIS_Pos                  9                                              /**< (US_PTCR) Transmitter Transfer Disable Position */
#define US_PTCR_TXTDIS_Msk                  (_U_(0x1) << US_PTCR_TXTDIS_Pos)               /**< (US_PTCR) Transmitter Transfer Disable Mask */
#define US_PTCR_TXTDIS                      US_PTCR_TXTDIS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTCR_TXTDIS_Msk instead */
#define US_PTCR_RXCBEN_Pos                  16                                             /**< (US_PTCR) Receiver Circular Buffer Enable Position */
#define US_PTCR_RXCBEN_Msk                  (_U_(0x1) << US_PTCR_RXCBEN_Pos)               /**< (US_PTCR) Receiver Circular Buffer Enable Mask */
#define US_PTCR_RXCBEN                      US_PTCR_RXCBEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTCR_RXCBEN_Msk instead */
#define US_PTCR_RXCBDIS_Pos                 17                                             /**< (US_PTCR) Receiver Circular Buffer Disable Position */
#define US_PTCR_RXCBDIS_Msk                 (_U_(0x1) << US_PTCR_RXCBDIS_Pos)              /**< (US_PTCR) Receiver Circular Buffer Disable Mask */
#define US_PTCR_RXCBDIS                     US_PTCR_RXCBDIS_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTCR_RXCBDIS_Msk instead */
#define US_PTCR_TXCBEN_Pos                  18                                             /**< (US_PTCR) Transmitter Circular Buffer Enable Position */
#define US_PTCR_TXCBEN_Msk                  (_U_(0x1) << US_PTCR_TXCBEN_Pos)               /**< (US_PTCR) Transmitter Circular Buffer Enable Mask */
#define US_PTCR_TXCBEN                      US_PTCR_TXCBEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTCR_TXCBEN_Msk instead */
#define US_PTCR_TXCBDIS_Pos                 19                                             /**< (US_PTCR) Transmitter Circular Buffer Disable Position */
#define US_PTCR_TXCBDIS_Msk                 (_U_(0x1) << US_PTCR_TXCBDIS_Pos)              /**< (US_PTCR) Transmitter Circular Buffer Disable Mask */
#define US_PTCR_TXCBDIS                     US_PTCR_TXCBDIS_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTCR_TXCBDIS_Msk instead */
#define US_PTCR_ERRCLR_Pos                  24                                             /**< (US_PTCR) Transfer Bus Error Clear Position */
#define US_PTCR_ERRCLR_Msk                  (_U_(0x1) << US_PTCR_ERRCLR_Pos)               /**< (US_PTCR) Transfer Bus Error Clear Mask */
#define US_PTCR_ERRCLR                      US_PTCR_ERRCLR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTCR_ERRCLR_Msk instead */
#define US_PTCR_MASK                        _U_(0x10F0303)                                 /**< \deprecated (US_PTCR) Register MASK  (Use US_PTCR_Msk instead)  */
#define US_PTCR_Msk                         _U_(0x10F0303)                                 /**< (US_PTCR) Register Mask  */


/* -------- US_PTSR : (USART Offset: 0x124) (R/ 32) Transfer Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXTEN:1;                   /**< bit:      0  Receiver Transfer Enable                 */
    uint32_t :7;                        /**< bit:   1..7  Reserved */
    uint32_t TXTEN:1;                   /**< bit:      8  Transmitter Transfer Enable              */
    uint32_t :7;                        /**< bit:  9..15  Reserved */
    uint32_t RXCBEN:1;                  /**< bit:     16  Receiver Circular Buffer Enable          */
    uint32_t :1;                        /**< bit:     17  Reserved */
    uint32_t TXCBEN:1;                  /**< bit:     18  Transmitter Circular Buffer Enable       */
    uint32_t :5;                        /**< bit: 19..23  Reserved */
    uint32_t ERR:1;                     /**< bit:     24  Transfer Bus Error                       */
    uint32_t :7;                        /**< bit: 25..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} US_PTSR_Type;
