ataradov/mcu-starter-projects/samg53/include/component/usart.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define US_PTSR_OFFSET                      (0x124)                                       /**<  (US_PTSR) Transfer Status Register  Offset */

#define US_PTSR_RXTEN_Pos                   0                                              /**< (US_PTSR) Receiver Transfer Enable Position */
#define US_PTSR_RXTEN_Msk                   (_U_(0x1) << US_PTSR_RXTEN_Pos)                /**< (US_PTSR) Receiver Transfer Enable Mask */
#define US_PTSR_RXTEN                       US_PTSR_RXTEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTSR_RXTEN_Msk instead */
#define US_PTSR_TXTEN_Pos                   8                                              /**< (US_PTSR) Transmitter Transfer Enable Position */
#define US_PTSR_TXTEN_Msk                   (_U_(0x1) << US_PTSR_TXTEN_Pos)                /**< (US_PTSR) Transmitter Transfer Enable Mask */
#define US_PTSR_TXTEN                       US_PTSR_TXTEN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTSR_TXTEN_Msk instead */
#define US_PTSR_RXCBEN_Pos                  16                                             /**< (US_PTSR) Receiver Circular Buffer Enable Position */
#define US_PTSR_RXCBEN_Msk                  (_U_(0x1) << US_PTSR_RXCBEN_Pos)               /**< (US_PTSR) Receiver Circular Buffer Enable Mask */
#define US_PTSR_RXCBEN                      US_PTSR_RXCBEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTSR_RXCBEN_Msk instead */
#define US_PTSR_TXCBEN_Pos                  18                                             /**< (US_PTSR) Transmitter Circular Buffer Enable Position */
#define US_PTSR_TXCBEN_Msk                  (_U_(0x1) << US_PTSR_TXCBEN_Pos)               /**< (US_PTSR) Transmitter Circular Buffer Enable Mask */
#define US_PTSR_TXCBEN                      US_PTSR_TXCBEN_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTSR_TXCBEN_Msk instead */
#define US_PTSR_ERR_Pos                     24                                             /**< (US_PTSR) Transfer Bus Error Position */
#define US_PTSR_ERR_Msk                     (_U_(0x1) << US_PTSR_ERR_Pos)                  /**< (US_PTSR) Transfer Bus Error Mask */
#define US_PTSR_ERR                         US_PTSR_ERR_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use US_PTSR_ERR_Msk instead */
#define US_PTSR_MASK                        _U_(0x1050101)                                 /**< \deprecated (US_PTSR) Register MASK  (Use US_PTSR_Msk instead)  */
#define US_PTSR_Msk                         _U_(0x1050101)                                 /**< (US_PTSR) Register Mask  */


#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief USART hardware registers */
typedef struct {  
  __O  uint32_t US_CR;          /**< (USART Offset: 0x00) Control Register */
  __IO uint32_t US_MR;          /**< (USART Offset: 0x04) Mode Register */
  __O  uint32_t US_IER;         /**< (USART Offset: 0x08) Interrupt Enable Register */
  __O  uint32_t US_IDR;         /**< (USART Offset: 0x0C) Interrupt Disable Register */
  __I  uint32_t US_IMR;         /**< (USART Offset: 0x10) Interrupt Mask Register */
  __I  uint32_t US_CSR;         /**< (USART Offset: 0x14) Channel Status Register */
  __I  uint32_t US_RHR;         /**< (USART Offset: 0x18) Receive Holding Register */
  __O  uint32_t US_THR;         /**< (USART Offset: 0x1C) Transmit Holding Register */
  __IO uint32_t US_BRGR;        /**< (USART Offset: 0x20) Baud Rate Generator Register */
  __IO uint32_t US_RTOR;        /**< (USART Offset: 0x24) Receiver Time-out Register */
  __IO uint32_t US_TTGR;        /**< (USART Offset: 0x28) Transmitter Timeguard Register */
  RoReg8  Reserved1[0x18];
  __I  uint32_t US_NER;         /**< (USART Offset: 0x44) Number of Errors Register */
  RoReg8  Reserved2[0x9C];
  __IO uint32_t US_WPMR;        /**< (USART Offset: 0xE4) Write Protection Mode Register */
  __I  uint32_t US_WPSR;        /**< (USART Offset: 0xE8) Write Protection Status Register */
  RoReg8  Reserved3[0x14];
  __IO uint32_t US_RPR;         /**< (USART Offset: 0x100) Receive Pointer Register */
  __IO uint32_t US_RCR;         /**< (USART Offset: 0x104) Receive Counter Register */
  __IO uint32_t US_TPR;         /**< (USART Offset: 0x108) Transmit Pointer Register */
  __IO uint32_t US_TCR;         /**< (USART Offset: 0x10C) Transmit Counter Register */
  __IO uint32_t US_RNPR;        /**< (USART Offset: 0x110) Receive Next Pointer Register */
  __IO uint32_t US_RNCR;        /**< (USART Offset: 0x114) Receive Next Counter Register */
  __IO uint32_t US_TNPR;        /**< (USART Offset: 0x118) Transmit Next Pointer Register */
  __IO uint32_t US_TNCR;        /**< (USART Offset: 0x11C) Transmit Next Counter Register */
  __O  uint32_t US_PTCR;        /**< (USART Offset: 0x120) Transfer Control Register */
  __I  uint32_t US_PTSR;        /**< (USART Offset: 0x124) Transfer Status Register */
} Usart;

#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief USART hardware registers */
typedef struct {  
  __O  US_CR_Type                     US_CR;          /**< Offset: 0x00 ( /W  32) Control Register */
  __IO US_MR_Type                     US_MR;          /**< Offset: 0x04 (R/W  32) Mode Register */
  __O  US_IER_Type                    US_IER;         /**< Offset: 0x08 ( /W  32) Interrupt Enable Register */
  __O  US_IDR_Type                    US_IDR;         /**< Offset: 0x0C ( /W  32) Interrupt Disable Register */
  __I  US_IMR_Type                    US_IMR;         /**< Offset: 0x10 (R/   32) Interrupt Mask Register */
  __I  US_CSR_Type                    US_CSR;         /**< Offset: 0x14 (R/   32) Channel Status Register */
  __I  US_RHR_Type                    US_RHR;         /**< Offset: 0x18 (R/   32) Receive Holding Register */
  __O  US_THR_Type                    US_THR;         /**< Offset: 0x1C ( /W  32) Transmit Holding Register */
  __IO US_BRGR_Type                   US_BRGR;        /**< Offset: 0x20 (R/W  32) Baud Rate Generator Register */
  __IO US_RTOR_Type                   US_RTOR;        /**< Offset: 0x24 (R/W  32) Receiver Time-out Register */
  __IO US_TTGR_Type                   US_TTGR;        /**< Offset: 0x28 (R/W  32) Transmitter Timeguard Register */
  __I  uint32_t                       Reserved1[6];
  __I  US_NER_Type                    US_NER;         /**< Offset: 0x44 (R/   32) Number of Errors Register */
  __I  uint32_t                       Reserved2[39];
  __IO US_WPMR_Type                   US_WPMR;        /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I  US_WPSR_Type                   US_WPSR;        /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I  uint32_t                       Reserved3[5];
  __IO US_RPR_Type                    US_RPR;         /**< Offset: 0x100 (R/W  32) Receive Pointer Register */
  __IO US_RCR_Type                    US_RCR;         /**< Offset: 0x104 (R/W  32) Receive Counter Register */
  __IO US_TPR_Type                    US_TPR;         /**< Offset: 0x108 (R/W  32) Transmit Pointer Register */
  __IO US_TCR_Type                    US_TCR;         /**< Offset: 0x10C (R/W  32) Transmit Counter Register */
  __IO US_RNPR_Type                   US_RNPR;        /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register */
  __IO US_RNCR_Type                   US_RNCR;        /**< Offset: 0x114 (R/W  32) Receive Next Counter Register */
  __IO US_TNPR_Type                   US_TNPR;        /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register */
  __IO US_TNCR_Type                   US_TNCR;        /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register */
  __O  US_PTCR_Type                   US_PTCR;        /**< Offset: 0x120 ( /W  32) Transfer Control Register */
  __I  US_PTSR_Type                   US_PTSR;        /**< Offset: 0x124 (R/   32) Transfer Status Register */
} Usart;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** @}  end of Universal Synchronous Asynchronous Receiver Transmitter */

#endif /* _SAMG53_USART_COMPONENT_H_ */
